Autodesk.Revit.DB.ReferenceWithContext.GetInstanceTransform
Gets the transform of the instance.
Returns:
The transform of an instance when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
Since:
2012

Autodesk.Revit.DB.ReferenceWithContext.GetReference
Gets the reference of the geometric object.
Returns:
The reference of a geometric object when it is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
Since:
2012

Autodesk.Revit.DB.ReferenceWithContext.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ReferenceWithContext.Proximity
The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
Since:
2012

Autodesk.Revit.DB.ReferenceWithContext
An object including a reference to a geometric object and related context, as instance transform etc.
Remarks:
The ReferenceWithContext is used as the returned value from the method Autodesk::Revit::DB::Document::FindReferencesWithContextByDirection,
ReferenceIntersector.Find(XYZ, XYZ), or ReferenceIntersector.FindNearest(XYZ, XYZ).
It includes a reference intersecting a line extended in a certain direction from an origin point and the context of the geometric object, as
the transform and proximity.
Since:
2012